document.addEventListener('DOMContentLoaded', function() {
    const gallery = document.getElementById('gallery');
    const movieDetail = document.getElementById('movie-detail');
    const movieVideo = document.getElementById('movie-video');
    const movieTitle = document.getElementById('movie-title');
    const movieDescriptionText = document.getElementById('movie-description-text');
    const backButton = document.getElementById('back-button');

    // ข้อมูลภาพยนตร์
 const movies = {
    "deadpool 3": {
         video: "/Video/Deadpool & Wolverine.mp4",
         poster: "/Photo/Deadpool & Wolverine (2024).jpg",
         description: "เรื่องย่อ Marvel Studios' Deadpool & Wolverine : ขณะที่ วูลฟ์เวอร์รีน ผู้เหนื่อยล้ากำกังฟื้นฟูอาการบาดเจ็บของตนเอง เขาก็ได้มาพบกับจอมพูดมากอย่าง เดดพูล ผู้ที่เดินทางข้ามเวลามายังอนาคตเพื่อที่จะรักษามิตรสหายที่ยิ่งใหญ่ที่สุดของเขา ด้วยความหวังที่ว่าจะสามารถผูกมิตรกับเจ้าสัตว์ร้ายและร่วมมือกันเพื่อนที่จะปราบศัตรูที่พวกเขามีร่วมกัน "
     },
     "furiosa": {
         video: "/Video/furiosa.mp4",
         poster: "/Photo/Furiosa A Mad Max Saga (2024).jpg 2.jpg",
         description: "เรื่องย่อ Furiosa: A Mad Max Saga ฟูริโอซ่า มหากาพย์ แมด แม็กซ์ เมื่อโลกล่มสลาย สาวน้อย ฟิรูโอซ่า ถูกแย่งชิงจากกลุ่มแมนนี มาเธอร์ส ผู้รักสันติ และตกไปอยู่ในมือของ ไบค์เกอร์ ฮอร์ด ผู้ยิ่งใหญ่ ที่นำโดย วอร์ลอร์ด เดเมนตัส พวกเขากวาดล้างดินแดนรกร้างและพบเข้ากับป้อมปราการซึ่งมี อิมมอร์ทัล โจ เป็นประธาน ในขณะที่ ไทรแอนท์ ทั้งสองทำสงครามเพื่อแย่งชิงอำนาจ ฟูริโอซ่าจะต้องเอาชีวิตรอดจากการทดลองมากมาย ในขณะเดียวกันเธอก็ต้องหาทางกลับบ้านให้ได้"
     },
     'dune': {
         title: 'Dune',
         poster: '/Photo/Dune --1.jpg',
         video: '/Video/Dune 1.mp4',
         description: "เรื่องย่อ : Dune เรื่องราวในอาณาจักรกาแลคซีอันไกลโพ้น ราชวงศ์อาทรีเดสของพอลได้มารับหน้าที่ปกครองดาวทะเลทรายชื่ออาร์ราคีสซึ่งมีทรัพยากรที่สำคัญที่สุดในจักรวาลที่เรียกว่า สไปรย์ ซึ่งช่วยในการเดินทางข้ามจักรวาล ขณะเดียวกัน จักรพรรดิแห่งกาแลคซีก็หวั่นเกรงต่อราชวงศ์อาทรีเดสที่เริ่มเป็นที่นิยมชมชอบของราชวงศ์อื่น ๆ จึงได้ร่วมมือกันกับราชวงศ์ที่เป็นปรปักษ์วางแผนลอบสังหารตระกูลอาทรีเดส แต่พอลกับเลดี้ เจสซิกา แม่ของเขาหนีไปได้ และเข้าร่วมกลุ่มกับชาวฟรีแมนที่เป็นชนพื้นเมือง"
     },

     'dune part two': {
         title: 'Dune Part Two',
         poster: '/Photo/Dune --2.jpg',
         video: '/Video/Dune Part 2.mp4',
         description: "เรื่องย่อ : Dune Part Two เรื่องราวการผจญภัยของ พอล อะเทรดีส (แสดงโดย ทิโมธี ชาลาเมต์) แห่งอะเทรดีส ที่ต้องเดินทางออกจากมาตุภูมิบ้านเกิด ท่ามกลางกับดักทางการเมืองและสงครามแสวงหาทรัพยากรในโลกยุคอนาคต โดยในภาคนี้พอลจะต้องพิสูจน์ตัวเองเอาชนะความกลัวด้วยการเข้าร่วมกับ เดอะเฟรเมน ชนเผ่าพื้นเมืองที่มีความสามารถในการเรียกหนอนทะเลทรายยักษ์ได้ เพื่อผ่านด่านทดสอบใน ดูน โดยมีเรื่องราวของโชคชะตาและคำพยากรณ์ที่กำหนดผู้ถูกเลือก"
     },
     'kong': {
         title: 'Godzilla Versus Kong The New Emprie (2024)',
         poster: '/Photo/kong 1.jpg',
         video: '/Video/Kong.mp4',
         description: "อีกหนึ่งการขยายจักรวาลมอนสเตอร์เวิร์ส หลังจากที่ปูทางไว้แล้วใน Kong: Skull Island (2017) และ Godzilla vs. Kong (2021) โดยครั้งนี้ได้ อดัม วิงการ์ด (Adam Wingard) รับหน้าที่พาทุกคนไปร่วมผจญภัยใน Godzilla x Kong: The New Empire ก็อดซิลล่า ปะทะ คอง 2 อาณาจักรใหม่ ซึ่งในครั้งนี้คองผู้ยิ่งใหญ่และก็อดซิลล่าผู้น่าสะพรึงต้องเผชิญกับภัยคุกคามขนาดมหึมาที่ซ่อนอยู่ภายในโลกของเรา และยังท้าทายการดำรงอยู่ของพวกมันรวมถึงพวกเราด้วย หนังจะเจาะลึกไปถึงประวัติศาสตร์และการกำเนิดของเหล่าไททัน เช่นเดียวกับความลึกลับของ Skull Island และที่อื่น ๆ ขณะเดียวกันก็เปิดเผยการต่อสู้ในตำนานที่ช่วยสร้างสิ่งมีชีวิตที่ไม่ธรรมดาเหล่านี้และผูกมัดพวกมันไว้กับมนุษยชาติตลอดไป"
     },
     'twisters': {
         title: 'Twisters (2024)',
         poster: '/Photo/Twisters Movie Poster.jpg 1.jpg',
         video: '/Video/Twisters.mp4',
         description: "เรื่องย่อ : Twisters หนังว่าด้วยเรื่องราวของ เคท คูเปอร์ นักล่าพายุที่เคยเผชิญหน้ากับพายุทอร์นาโดในช่วงเรียนมหาวิทยาลัย ตอนนี้เธอกำลังศึกษารูปแบบของพายุบนหน้าจออย่างปลอดภัยในนิวยอร์ก ซิตี แต่แล้วก็มีเหตุให้ต้องออกไปทำงานภาคสนามเพื่อทดสอบระบบติดตามพายุสุดล้ำ ซึ่งที่นั่นเธอได้บังเอิญพบกับไทเลอร์ โอเวนส์ ซูเปอร์สตาร์โซเชียลมีเดียผู้มีเสน่ห์และบ้าบิ่น ที่ประสบความสำเร็จในการโพสต์การผจญภัยไล่ล่าพายุไปพร้อมกับทีมของเขา ยิ่งอันตรายมากเท่าไรก็ยิ่งดี"
     },
     'john 1': {
         title: 'John Wick (2014)',
         poster: '/Photo/John Wick 1.1.jpg',
         video: '/Video/John Wick 1.mp4',
         description: "จอห์น วิค (คีอานู รีฟส์) นักฆ่ามือ 1 ของวงการ ที่ตัดสินใจล้างมือจากโลกมืดและเริ่มต้นใช้ชีวิตใหม่อย่างเงียบสงบหลังจากภรรยาเสียชีวิต แต่ชีวิตของเขาไม่เป็นอย่างที่คิด เมื่อเขาถูกหมายหัวจากหัวหน้าแก๊งอาชญากรที่มีอำนาจที่สุดของนิวยอร์ค โดยมีนักฆ่าฝีมือฉกาจที่เคยเป็นเพื่อนสนิทที่สุดกับเขามารับหน้าที่ตามล่าตัวเขา ยอดนักฆ่าอย่าง จอห์น วิค จึงต้องทำทุกวิถีทางเพื่อหาคำตอบว่าเกิดอะไรขึ้นกับเขากันแน่ พวกมันต้องการตามล่าเขาไปทำไม และพร้อมจะเอาคืนชนิดกระสุนแลกกระสุน"
     },
     'john 2': {
         title: 'John Wick 2 (2017)',
         poster: '/Photo/John Wick 2.1.jpg',
         video: '/Video/John Wick 2.1.mp4',
         description: "John Wick: Chapter 2 จะเล่าเรื่องราวของ จอห์น วิค มือสังหารผู้เป็นตำนานที่ถูกบีบให้กลับมาทำงานอีกครั้งหลังจากเกษียณตัวเองไป เพราะอดีตเพื่อนร่วมงานได้วางแผนเข้าควบคุมองค์กรมือสังหารลับข้ามชาติ ด้วยความผูกพันธ์ดุจพี่น้องต่างสายเลือด จอห์น วิค ให้คำมั่นว่าจะช่วย เขาได้เดินทางไปยังกรุงโรม ที่ซึ่งเขาต้องเผชิญหน้ากับเหล่าบรรดานักฆ่าที่อันตรายที่สุดในโลก"
     },
     'john 3': {
         title: 'John Wick Parabellum (2019)',
         poster: '/Photo/John Wick 3.1.jpg',
         video: '/Video/John Wick 3.mp4',
         description: "John Wick 3: Parabellum ในภาคใหม่นี้ John Wick ต้องถูกคนทั้งโลกตามล่าด้วยค่าหัว $14 ล้านเหรียญ เนื่องจากเขาได้แหกกฎกลาง โดยการฆ่าคนในพื้นที่โรงแรมของ Continental และยิ่งคนที่เขาฆ่าคือสมาชิกระดับสูง เขาจึงต้องสู้และฆ่ากับศัตรูรอบด้านเพื่อหาทางหลบหนีออกจากเมืองนิวยอร์ก"
     },
     'john 4': {
         title: 'John Wick Chapter 4 (2023)',
         poster: '/Photo/John Wick 4.1.jpg',
         video: '/Video/John Wick 4.mp4',
         description: "เรื่องย่อ John Wick Chapter 4 พาผู้ชมไปสู่จักรวาลนักฆ่าที่ถูกขยายขอบเขตยิ่งกว่าเดิม หลักจากที่ จอห์น วิค (คีอานู รีฟส์) เอาตัวรอดจากนักฆ่าและการตามล่าจากสภาสูงมาได้ เขาได้ค้นพบว่าหนทางรอดเดียวที่จะทำให้ชีวิตเขาเป็นอิสระ คือการต้องกลับมาเผชิญหน้ากับชะตากรรมที่รอเขาอยู่และเป้าหมายเดียวคือต้องโค่นสภาสูงให้สำเร็จ โดยครั้งนี้เขาต้องรับมือกับศัตรูอำมหิตรายใหม่ที่มีอิทธิพลกว้างขวางไปทั่ววงศ์วานนักฆ่าทั้งโลก ผู้พร้อมจะเปลี่ยนมิตรให้กลายเป็นศัตรู เปลี่ยนลมหายใจให้กลายเป็นร่างไร้วิญญาณ เปิดฉากการตามล่าครั้งใหม่ที่กินอาณาเขตแค้นไปถึง 3 ทวีป ทั้งในนิวยอร์ก ปารีส เบอร์ลิน และโอซาก้า"
     },
 };

    // สร้างภาพยนตร์ในแกลเลอรี
    for (const title in movies) {
        const showItem = document.createElement('div');
        showItem.className = 'show-item';
        showItem.setAttribute('data-title', title);
        showItem.innerHTML = `<img src="${movies[title].poster}" alt="${title}">`;

        showItem.addEventListener('click', function() {
            showMovieDetails(title);
        });

        gallery.appendChild(showItem);
    }

    // แสดงรายละเอียดหนัง
    function showMovieDetails(title) {
        const movie = movies[title];
        movieVideo.src = movie.video;
        movieTitle.textContent = title.charAt(0).toUpperCase() + title.slice(1);
        movieDescriptionText.textContent = movie.description;

        gallery.style.display = 'none';
        movieDetail.style.display = 'block';
    }

    // กลับไปที่แกลเลอรี
    backButton.addEventListener('click', function() {
        movieDetail.style.display = 'none';
        gallery.style.display = 'grid';
    });
});
