document.addEventListener('DOMContentLoaded', function() {
    const gallery = document.getElementById('gallery');
    const movieDetail = document.getElementById('movie-detail');
    const movieVideo = document.getElementById('movie-video');
    const movieTitle = document.getElementById('movie-title');
    const movieDescriptionText = document.getElementById('movie-description-text');
    const backButton = document.getElementById('back-button');

   // ข้อมูลภาพยนตร์
const movies = {
    "deadpool 3": {
         video: "/Video/Deadpool & Wolverine.mp4",
         poster: "/Photo/Deadpool & Wolverine (2024).jpg",
         description: "เรื่องย่อ Marvel Studios' Deadpool & Wolverine : ขณะที่ วูลฟ์เวอร์รีน ผู้เหนื่อยล้ากำกังฟื้นฟูอาการบาดเจ็บของตนเอง เขาก็ได้มาพบกับจอมพูดมากอย่าง เดดพูล ผู้ที่เดินทางข้ามเวลามายังอนาคตเพื่อที่จะรักษามิตรสหายที่ยิ่งใหญ่ที่สุดของเขา ด้วยความหวังที่ว่าจะสามารถผูกมิตรกับเจ้าสัตว์ร้ายและร่วมมือกันเพื่อนที่จะปราบศัตรูที่พวกเขามีร่วมกัน "
     },
     "furiosa": {
         video: "/Video/furiosa.mp4",
         poster: "/Photo/Furiosa A Mad Max Saga (2024).jpg 2.jpg",
         description: "เรื่องย่อ Furiosa: A Mad Max Saga ฟูริโอซ่า มหากาพย์ แมด แม็กซ์ เมื่อโลกล่มสลาย สาวน้อย ฟิรูโอซ่า ถูกแย่งชิงจากกลุ่มแมนนี มาเธอร์ส ผู้รักสันติ และตกไปอยู่ในมือของ ไบค์เกอร์ ฮอร์ด ผู้ยิ่งใหญ่ ที่นำโดย วอร์ลอร์ด เดเมนตัส พวกเขากวาดล้างดินแดนรกร้างและพบเข้ากับป้อมปราการซึ่งมี อิมมอร์ทัล โจ เป็นประธาน ในขณะที่ ไทรแอนท์ ทั้งสองทำสงครามเพื่อแย่งชิงอำนาจ ฟูริโอซ่าจะต้องเอาชีวิตรอดจากการทดลองมากมาย ในขณะเดียวกันเธอก็ต้องหาทางกลับบ้านให้ได้"
     },
     'abigail': {
         title: 'Abigail (2024)',
         poster: '/Photo/ab 1.jpg',
         video: '/Video/Abigail.mp4',
         description: "เรื่องย่อ Abigail ภายหลังจากที่แก๊งอาชญากรได้ก่อเหตุลักพาตัวหนูน้อยนักบัลเลต์ ที่เป็นลูกสาวมหาเศรษฐีผู้ทรงอิทธิพลของเมือง ด้วยการจับมากักขังเอาไว้ในห้องใต้ดินชื้น ๆ ใต้ตฤหาสน์อันโดดเดี่ยวแห่งหนึ่ง เพื่อหวังจะมาเรียกค่าไถ่ แต่พวกเขาไม่ล่วงรู้มาก่อเหตุว่าเด็กหญิงตัวน้อย ๆ ที่ชื่อว่า อบิเกล เธออาจจะไม่ใช่คนอ่อนแอที่พวกเขาคิด"
     },
     'the crow': {
         title: 'The Crow (2024)',
         poster: '/Photo/Crow 1.jpg',
         video: '/Video/The Crow.mp4',
         description: "เรื่องย่อ The Crow อีกาพญายม เอริค ดราเวน ผู้ซึ่งมีชีวิตที่ได้รับความไม่ยุติธรรมและถูกพรากสิ่งสำคัญในชีวิตไปจากการรุมทำร้าย เขาเสียชีวิตไปแต่แล้วในเวลาต่อมาเขาฟื้นคืนชีพขึ้นมาพร้อมกับอีกาและเขาพร้อมที่จะล้างแค้นให้กับสิ่งที่เขาได้สูญเสียไป"
     },
     'deadpool': {
         title: 'Deadpool (2016)',
         poster: '/Photo/Deadpool 1.jpg',
         video: '/Video/Deadpool.mp4',
         description: "เรื่องย่อ Deadpool : อดีตเจ้าหน้าที่หน่วยเฉพาะกิจที่ผันตัวเองเป็นทหารรับจ้าง เวด วิลสัน เขาต้องผ่านการทดลองลับทำให้เขามีพลังสมานแผลได้อย่างรวดเร็ว และได้แปลงร่างเป็นเดดพูล ถูกหล่อหลอมด้วยคุณสมบัติใหม่และดูลึกลับ เปลี่ยนไปจากคนที่เคยอารมณ์ดี เดดพูลจึงออกล่าตามหาคนที่เกือบจะทำลายชีวิตของเขาไป"
     },
     'deadpool 2': {
         title: 'Deadpool 2 (2018)',
         poster: '/Photo/Deadpool 2.jpg',
         video: '/Video/Deadpool 2.mp4',
         description: "เรื่องย่อ : เดดพูล รวมทีมปกป้องเด็กอ้วนจาก เคเบิล คู่ปรับคนใหม่ของเดดพูลที่มาเพื่อฆ่าเด็กคนนี้โดยเฉพาะ เพราะเป็นภารกิจยิ่งใหญ่จึงจำเป็นต้องเกณฑ์คนร่วมทีมทั้งมนุษย์กลายพันธุ์อย่าง โดมิโน มิวแทนต์ที่เกิดจากโครงการเพาะพันธุ์มิวแทนต์ที่คาดว่าจะนำไปใช้ทางการทหาร พลังของเธอคือความโชคดี ซึ่งเธอมีพลังพิเศษที่ควบคุมโชคชะตาให้เข้าข้างเธอได้ และคนธรรมดาที่.. แค่อยากได้งานทำ !!"
     },
     'fall guy': {
         title: 'Fall Guy',
         poster: '/Photo/fall guy --1.jpg',
         video: '/Video/Fall Guy.mp4',
         description: "เรื่องย่อ The Fall Guy สตันท์แมนคนจริงเขาคือ โคลต์ ซีเวอร์ส นักแสดงสตันท์แมนที่เลือกจะผละตัวและออกจากอาชีพนี้ไปเมื่อปีก่อน เพื่อใส่ใจกับเรื่องสุขภาพกายและสุขภาพจิตใจของเขา แต่เขากลับถูกทาบทามให้กลับมารับหน้าที่อีกครั้ง หลังจากที่ดาราหนังที่สตูดิโอชื่อดังได้วางตัวเอาไว้และทุ่มทุนสร้างอย่างมหาศาลได้หายตัวไป การจึงต้องค้นหาและเรียกคืนจิตวิญญาณแห่งอาชีพของตัวเองกลับมาอีกครั้ง"
     },
     'kong': {
         title: 'Godzilla Versus Kong The New Emprie (2024)',
         poster: '/Photo/kong 1.jpg',
         video: '/Video/Kong.mp4',
         description: "อีกหนึ่งการขยายจักรวาลมอนสเตอร์เวิร์ส หลังจากที่ปูทางไว้แล้วใน Kong: Skull Island (2017) และ Godzilla vs. Kong (2021) โดยครั้งนี้ได้ อดัม วิงการ์ด (Adam Wingard) รับหน้าที่พาทุกคนไปร่วมผจญภัยใน Godzilla x Kong: The New Empire ก็อดซิลล่า ปะทะ คอง 2 อาณาจักรใหม่ ซึ่งในครั้งนี้คองผู้ยิ่งใหญ่และก็อดซิลล่าผู้น่าสะพรึงต้องเผชิญกับภัยคุกคามขนาดมหึมาที่ซ่อนอยู่ภายในโลกของเรา และยังท้าทายการดำรงอยู่ของพวกมันรวมถึงพวกเราด้วย หนังจะเจาะลึกไปถึงประวัติศาสตร์และการกำเนิดของเหล่าไททัน เช่นเดียวกับความลึกลับของ Skull Island และที่อื่น ๆ ขณะเดียวกันก็เปิดเผยการต่อสู้ในตำนานที่ช่วยสร้างสิ่งมีชีวิตที่ไม่ธรรมดาเหล่านี้และผูกมัดพวกมันไว้กับมนุษยชาติตลอดไป"
     },
     'kungfu': {
         title: 'Kungfu Panda 4 (2024)',
         poster: '/Photo/Panda 1.jpg',
         video: '/Video/Kungfu Panda 4.mp4',
         description: "เรื่องย่อ Kung Fu Panda 4 กังฟูแพนด้า 4 หลังจากการผจญภัยท้ามฤตยูเพื่อปราบวายร้ายระดับโลกมาถึงสามครั้งสามคราด้วยความกล้าหาญที่หาตัวจับยากและทักษะศิลปะการต่อสู้สุดบ้าคลั่งของเขา โป นักรบมังกร ก็ถูกชะตากรรมลิขิตให้...พักผ่อนเสียที หรือถ้าจะพูดให้เฉพาะเจาะจงกว่านั้น เขาได้รับการทาบทามให้เป็นผู้นำทางจิตวิญญาณแห่งหุบเขาสันติภาพ ซึ่งทำให้เกิดปัญหาที่ชัดเจนหลายประการด้วยกัน ข้อแรก โปรู้เรื่องเกี่ยวกับการเป็นผู้นำทางจิตวิญญาณมากพอๆ กับที่เขารู้เกี่ยวกับวิถีการลดน้ำหนักด้วยการกินแบบมนุษย์ยุคหิน และข้อสอง เขาต้องตามหาและฝึกฝนนักรบมังกรคนใหม่ให้ไวก่อนที่เขาจะเข้ารับตำแหน่งใหม่ที่สูงส่งของเขาได้"
     },
     'john 1': {
         title: 'John Wick (2014)',
         poster: '/Photo/John Wick 1.1.jpg',
         video: '/Video/John Wick 1.mp4',
         description: "จอห์น วิค (คีอานู รีฟส์) นักฆ่ามือ 1 ของวงการ ที่ตัดสินใจล้างมือจากโลกมืดและเริ่มต้นใช้ชีวิตใหม่อย่างเงียบสงบหลังจากภรรยาเสียชีวิต แต่ชีวิตของเขาไม่เป็นอย่างที่คิด เมื่อเขาถูกหมายหัวจากหัวหน้าแก๊งอาชญากรที่มีอำนาจที่สุดของนิวยอร์ค โดยมีนักฆ่าฝีมือฉกาจที่เคยเป็นเพื่อนสนิทที่สุดกับเขามารับหน้าที่ตามล่าตัวเขา ยอดนักฆ่าอย่าง จอห์น วิค จึงต้องทำทุกวิถีทางเพื่อหาคำตอบว่าเกิดอะไรขึ้นกับเขากันแน่ พวกมันต้องการตามล่าเขาไปทำไม และพร้อมจะเอาคืนชนิดกระสุนแลกกระสุน"
     },
     'john 2': {
         title: 'John Wick 2 (2017)',
         poster: '/Photo/John Wick 2.1.jpg',
         video: '/Video/John Wick 2.1.mp4',
         description: "John Wick: Chapter 2 จะเล่าเรื่องราวของ จอห์น วิค มือสังหารผู้เป็นตำนานที่ถูกบีบให้กลับมาทำงานอีกครั้งหลังจากเกษียณตัวเองไป เพราะอดีตเพื่อนร่วมงานได้วางแผนเข้าควบคุมองค์กรมือสังหารลับข้ามชาติ ด้วยความผูกพันธ์ดุจพี่น้องต่างสายเลือด จอห์น วิค ให้คำมั่นว่าจะช่วย เขาได้เดินทางไปยังกรุงโรม ที่ซึ่งเขาต้องเผชิญหน้ากับเหล่าบรรดานักฆ่าที่อันตรายที่สุดในโลก"
     },
     'john 3': {
         title: 'John Wick Parabellum (2019)',
         poster: '/Photo/John Wick 3.1.jpg',
         video: '/Video/John Wick 3.mp4',
         description: "John Wick 3: Parabellum ในภาคใหม่นี้ John Wick ต้องถูกคนทั้งโลกตามล่าด้วยค่าหัว $14 ล้านเหรียญ เนื่องจากเขาได้แหกกฎกลาง โดยการฆ่าคนในพื้นที่โรงแรมของ Continental และยิ่งคนที่เขาฆ่าคือสมาชิกระดับสูง เขาจึงต้องสู้และฆ่ากับศัตรูรอบด้านเพื่อหาทางหลบหนีออกจากเมืองนิวยอร์ก"
     },
     'john 4': {
         title: 'John Wick Chapter 4 (2023)',
         poster: '/Photo/John Wick 4.1.jpg',
         video: '/Video/John Wick 4.mp4',
         description: "เรื่องย่อ John Wick Chapter 4 พาผู้ชมไปสู่จักรวาลนักฆ่าที่ถูกขยายขอบเขตยิ่งกว่าเดิม หลักจากที่ จอห์น วิค (คีอานู รีฟส์) เอาตัวรอดจากนักฆ่าและการตามล่าจากสภาสูงมาได้ เขาได้ค้นพบว่าหนทางรอดเดียวที่จะทำให้ชีวิตเขาเป็นอิสระ คือการต้องกลับมาเผชิญหน้ากับชะตากรรมที่รอเขาอยู่และเป้าหมายเดียวคือต้องโค่นสภาสูงให้สำเร็จ โดยครั้งนี้เขาต้องรับมือกับศัตรูอำมหิตรายใหม่ที่มีอิทธิพลกว้างขวางไปทั่ววงศ์วานนักฆ่าทั้งโลก ผู้พร้อมจะเปลี่ยนมิตรให้กลายเป็นศัตรู เปลี่ยนลมหายใจให้กลายเป็นร่างไร้วิญญาณ เปิดฉากการตามล่าครั้งใหม่ที่กินอาณาเขตแค้นไปถึง 3 ทวีป ทั้งในนิวยอร์ก ปารีส เบอร์ลิน และโอซาก้า"
     },
 };

    for (const title in movies) {
        const showItem = document.createElement('div');
        showItem.className = 'show-item';
        showItem.setAttribute('data-title', title);
        showItem.innerHTML = `<img src="${movies[title].poster}" alt="${title}">`;

        showItem.addEventListener('click', function() {
            showMovieDetails(title);
        });

        gallery.appendChild(showItem);
    }

    // แสดงรายละเอียดหนัง
    function showMovieDetails(title) {
        const movie = movies[title];
        movieVideo.src = movie.video;
        movieTitle.textContent = title.charAt(0).toUpperCase() + title.slice(1);
        movieDescriptionText.textContent = movie.description;

        gallery.style.display = 'none';
        movieDetail.style.display = 'block';
    }

    // กลับไปที่แกลเลอรี
    backButton.addEventListener('click', function() {
        movieDetail.style.display = 'none';
        gallery.style.display = 'grid';
    });
});


