document.addEventListener('DOMContentLoaded', function() {
    const gallery = document.getElementById('gallery');
    const movieDetail = document.getElementById('movie-detail');
    const movieVideo = document.getElementById('movie-video');
    const movieTitle = document.getElementById('movie-title');
    const movieDescriptionText = document.getElementById('movie-description-text');
    const backButton = document.getElementById('back-button');

    // ข้อมูลภาพยนตร์
 const movies = {
    "deadpool 3": {
         video: "/Video/Deadpool & Wolverine.mp4",
         poster: "/Photo/Deadpool & Wolverine (2024).jpg",
         description: "เรื่องย่อ Marvel Studios' Deadpool & Wolverine : ขณะที่ วูลฟ์เวอร์รีน ผู้เหนื่อยล้ากำกังฟื้นฟูอาการบาดเจ็บของตนเอง เขาก็ได้มาพบกับจอมพูดมากอย่าง เดดพูล ผู้ที่เดินทางข้ามเวลามายังอนาคตเพื่อที่จะรักษามิตรสหายที่ยิ่งใหญ่ที่สุดของเขา ด้วยความหวังที่ว่าจะสามารถผูกมิตรกับเจ้าสัตว์ร้ายและร่วมมือกันเพื่อนที่จะปราบศัตรูที่พวกเขามีร่วมกัน "
     },
     "anong": {
         video: "/Video/anong.mp4",
         poster: "/Photo/anong 1.jpg 2.webp",
         description: "“โจ” เกมเมอร์หนุ่มดวงตก ได้รับมรดกเป็นบ้านที่มีผีเจ้าของบ้านคนเก่า “อนงค์” แถมมาด้วย แต่คนก็ไม่ยอมหนี ผีก็ไม่ยอมไป คนกับผีเลยจับมือกันเปิดบ้านผีสิงให้คนมาเที่ยวเล่น แถมยังได้เห็นความน่ารักของผีบ้านนี้มากขึ้นทุกวันจนเกิดเป็นความรัก"
     },
     'deadpool': {
         title: 'Deadpool (2016)',
         poster: '/Photo/Deadpool 1.jpg',
         video: '/Video/Deadpool.mp4',
         description: "เรื่องย่อ Deadpool : อดีตเจ้าหน้าที่หน่วยเฉพาะกิจที่ผันตัวเองเป็นทหารรับจ้าง เวด วิลสัน เขาต้องผ่านการทดลองลับทำให้เขามีพลังสมานแผลได้อย่างรวดเร็ว และได้แปลงร่างเป็นเดดพูล ถูกหล่อหลอมด้วยคุณสมบัติใหม่และดูลึกลับ เปลี่ยนไปจากคนที่เคยอารมณ์ดี เดดพูลจึงออกล่าตามหาคนที่เกือบจะทำลายชีวิตของเขาไป"
     },
     'deadpool 2': {
         title: 'Deadpool 2 (2018)',
         poster: '/Photo/Deadpool 2.jpg',
         video: '/Video/Deadpool 2.mp4',
         description: "เรื่องย่อ : เดดพูล รวมทีมปกป้องเด็กอ้วนจาก เคเบิล คู่ปรับคนใหม่ของเดดพูลที่มาเพื่อฆ่าเด็กคนนี้โดยเฉพาะ เพราะเป็นภารกิจยิ่งใหญ่จึงจำเป็นต้องเกณฑ์คนร่วมทีมทั้งมนุษย์กลายพันธุ์อย่าง โดมิโน มิวแทนต์ที่เกิดจากโครงการเพาะพันธุ์มิวแทนต์ที่คาดว่าจะนำไปใช้ทางการทหาร พลังของเธอคือความโชคดี ซึ่งเธอมีพลังพิเศษที่ควบคุมโชคชะตาให้เข้าข้างเธอได้ และคนธรรมดาที่.. แค่อยากได้งานทำ !!"
     },
     'fall guy': {
         title: 'Fall Guy',
         poster: '/Photo/fall guy --1.jpg',
         video: '/Video/Fall Guy.mp4',
         description: "เรื่องย่อ The Fall Guy สตันท์แมนคนจริงเขาคือ โคลต์ ซีเวอร์ส นักแสดงสตันท์แมนที่เลือกจะผละตัวและออกจากอาชีพนี้ไปเมื่อปีก่อน เพื่อใส่ใจกับเรื่องสุขภาพกายและสุขภาพจิตใจของเขา แต่เขากลับถูกทาบทามให้กลับมารับหน้าที่อีกครั้ง หลังจากที่ดาราหนังที่สตูดิโอชื่อดังได้วางตัวเอาไว้และทุ่มทุนสร้างอย่างมหาศาลได้หายตัวไป การจึงต้องค้นหาและเรียกคืนจิตวิญญาณแห่งอาชีพของตัวเองกลับมาอีกครั้ง"
     },
     'kong': {
         title: 'Godzilla Versus Kong The New Emprie (2024)',
         poster: '/Photo/kong 1.jpg',
         video: '/Video/Kong.mp4',
         description: "อีกหนึ่งการขยายจักรวาลมอนสเตอร์เวิร์ส หลังจากที่ปูทางไว้แล้วใน Kong: Skull Island (2017) และ Godzilla vs. Kong (2021) โดยครั้งนี้ได้ อดัม วิงการ์ด (Adam Wingard) รับหน้าที่พาทุกคนไปร่วมผจญภัยใน Godzilla x Kong: The New Empire ก็อดซิลล่า ปะทะ คอง 2 อาณาจักรใหม่ ซึ่งในครั้งนี้คองผู้ยิ่งใหญ่และก็อดซิลล่าผู้น่าสะพรึงต้องเผชิญกับภัยคุกคามขนาดมหึมาที่ซ่อนอยู่ภายในโลกของเรา และยังท้าทายการดำรงอยู่ของพวกมันรวมถึงพวกเราด้วย หนังจะเจาะลึกไปถึงประวัติศาสตร์และการกำเนิดของเหล่าไททัน เช่นเดียวกับความลึกลับของ Skull Island และที่อื่น ๆ ขณะเดียวกันก็เปิดเผยการต่อสู้ในตำนานที่ช่วยสร้างสิ่งมีชีวิตที่ไม่ธรรมดาเหล่านี้และผูกมัดพวกมันไว้กับมนุษยชาติตลอดไป"
     },
     'ghost': {
         title: 'GhostBuster Frozen Empire (2024)',
         poster: '/Photo/ghost 1.jpg',
         video: '/Video/Ghost.mp4',
         description: "เรื่องย่อ Ghostbuster: Frozen Empire โกสต์บัสเตอร์ส: มหันตภัยเมืองเยือกแข็งครอบครัวสแปงเลอร์จะกลับมาสู่ที่ที่ทุกอย่างเริ่มต้นขึ้นอีกครั้ง ซึ่งก็คือสถานีดับเพลิงที่เราคุ้นเคยกันดี โดยพวกเขาและเธอจะมาร่วมทีมกับบริษัทกำจัดผีชุดดั้งเดิม ที่ได้ทำการพัฒนาศูนย์วิจัยลับกำจัดผีให้พัฒนาขึ้นไปอีกขั้นเป็นที่เรียบร้อยแล้ว แต่เมื่อการค้นพบวัตถุโบราณกลับกลายเป็นการปลดปล่อยพลังชั่วร้ายออกมา เหล่าโกสต์บัสเตอร์ทั้งหน้าเก่าและหน้าใหม่จึงต้องร่วมมือกันเพื่อปกป้องบ้านของพวกเขาและเธอ และช่วยเหลือโลกใบนี้ไม่ให้เข้าสู่ยุคนํ้าแข็งครั้งที่สอง"
     },
     'ma': {
         title: 'Ranhma (2024)',
         poster: '/Photo/ma 1.jpg',
         video: '/Video/Ma.mp4',
         description: "เรื่องย่อ หลานม่า (LAHN MAH) ภาพยนตร์ไทยแนวครอบครัวดราม่าจากค่าย GDH มีแรงบันดาลใจจากเรื่องจริงที่มีทุกครอบครัว ภาพยนตร์บันทึกช่วงเวลามีค่าของสิ่งที่เรียกว่า ครอบครัว ผลงานภาพยนตร์เรื่องแรกของ บิวกิ้น พุฒิพงศ์ มีกำหนดเข้าฉาย 4 เมษายน 2024"
     },
     'kungfu': {
         title: 'Kungfu Panda 4 (2024)',
         poster: '/Photo/Panda 1.jpg',
         video: '/Video/Kungfu Panda 4.mp4',
         description: "เรื่องย่อ Kung Fu Panda 4 กังฟูแพนด้า 4 หลังจากการผจญภัยท้ามฤตยูเพื่อปราบวายร้ายระดับโลกมาถึงสามครั้งสามคราด้วยความกล้าหาญที่หาตัวจับยากและทักษะศิลปะการต่อสู้สุดบ้าคลั่งของเขา โป นักรบมังกร ก็ถูกชะตากรรมลิขิตให้...พักผ่อนเสียที หรือถ้าจะพูดให้เฉพาะเจาะจงกว่านั้น เขาได้รับการทาบทามให้เป็นผู้นำทางจิตวิญญาณแห่งหุบเขาสันติภาพ ซึ่งทำให้เกิดปัญหาที่ชัดเจนหลายประการด้วยกัน ข้อแรก โปรู้เรื่องเกี่ยวกับการเป็นผู้นำทางจิตวิญญาณมากพอๆ กับที่เขารู้เกี่ยวกับวิถีการลดน้ำหนักด้วยการกินแบบมนุษย์ยุคหิน และข้อสอง เขาต้องตามหาและฝึกฝนนักรบมังกรคนใหม่ให้ไวก่อนที่เขาจะเข้ารับตำแหน่งใหม่ที่สูงส่งของเขาได้"
     },
     'supparoi': {
         title: 'Supparoi (2024)',
         poster: '/Photo/Supperroi.jpg',
         video: '/Video/Supa.mp4',
         description: "เรื่องย่อหนัง สัปเหร่อสัปเหร่อ เป็นเรื่องราวที่เกิดขึ้นในหมู่บ้านโนนคูณในจักรวาลไทบ้าน เล่าถึงชีวิต เจิด เด็กหนุ่มวัย 25 ปีที่เรียนจบกฎหมาย 7-8 ปี มีพ่อทำอาชีพ สัปเหร่อ เขาหวังจะไปสอบเป็นทนายหรือปลัดอำเภอ แต่ต้องมาช่วยพ่อเป็นสัปเหร่อ เพราะพ่อมีอาการป่วยจนต้องมาช่วยพ่อทำงาน แต่ลังเลเพราะเกิดเป็นคนที่กลัวผีมากๆ และต้องมาทำงานกับศพ"
     },
     'twisters': {
         title: 'Twisters (2024)',
         poster: '/Photo/Twisters Movie Poster.jpg 1.jpg',
         video: '/Video/Twisters.mp4',
         description: "เรื่องย่อ : Twisters หนังว่าด้วยเรื่องราวของ เคท คูเปอร์ นักล่าพายุที่เคยเผชิญหน้ากับพายุทอร์นาโดในช่วงเรียนมหาวิทยาลัย ตอนนี้เธอกำลังศึกษารูปแบบของพายุบนหน้าจออย่างปลอดภัยในนิวยอร์ก ซิตี แต่แล้วก็มีเหตุให้ต้องออกไปทำงานภาคสนามเพื่อทดสอบระบบติดตามพายุสุดล้ำ ซึ่งที่นั่นเธอได้บังเอิญพบกับไทเลอร์ โอเวนส์ ซูเปอร์สตาร์โซเชียลมีเดียผู้มีเสน่ห์และบ้าบิ่น ที่ประสบความสำเร็จในการโพสต์การผจญภัยไล่ล่าพายุไปพร้อมกับทีมของเขา ยิ่งอันตรายมากเท่าไรก็ยิ่งดี"
     },
     'term 3': {
         title: 'Term 3 (2024)',
         poster: '/Photo/term 3.webp',
         video: '/Video/Term 3.mp4',
         description: "ขอต้อนรับสู่ภาคเรียนสยองเทอมใหม่กับภาพยนตร์ไทยสยองขวัญแห่งปี ที่จะปลุกตำนานเรื่องเล่าและพิธีกรรม “บนบาน บายศรี ขอขมา” ในรั้วมหาวิทยาลัยของไทยให้หลอนสะพรึงสุดขีด"
     },
 };

    // สร้างภาพยนตร์ในแกลเลอรี
    for (const title in movies) {
        const showItem = document.createElement('div');
        showItem.className = 'show-item';
        showItem.setAttribute('data-title', title);
        showItem.innerHTML = `<img src="${movies[title].poster}" alt="${title}">`;

        showItem.addEventListener('click', function() {
            showMovieDetails(title);
        });

        gallery.appendChild(showItem);
    }

    // แสดงรายละเอียดหนัง
    function showMovieDetails(title) {
        const movie = movies[title];
        movieVideo.src = movie.video;
        movieTitle.textContent = title.charAt(0).toUpperCase() + title.slice(1);
        movieDescriptionText.textContent = movie.description;

        gallery.style.display = 'none';
        movieDetail.style.display = 'block';
    }

    // กลับไปที่แกลเลอรี
    backButton.addEventListener('click', function() {
        movieDetail.style.display = 'none';
        gallery.style.display = 'grid';
    });
});
